[
  {
    "settingId": "S_CoopHall",
    "medium": "Prestige-style political drama in a grand civic chamber.",
    "lens": "Moderate wide for hall scale, normal lens for tight exchanges at the floor.",
    "movement": "Slow, confident moves along walkways and between banners.",
    "lighting": "Warm white-gold overhead wash with gentle fill; faces and insignia clearly readable.",
    "composition": "Delegates framed against open space and banners, emphasizing shared identity and subtle separation."
  },
  {
    "settingId": "S_BHANexus",
    "medium": "High-tech operations drama focused on screens and operators.",
    "lens": "Normal lens for consoles, slight wide for whole tiers of stations.",
    "movement": "Measured tracks along rows of analysts, short pushes to critical data displays.",
    "lighting": "Cool, even lab light with bright but controlled holographic panels.",
    "composition": "Operators and harmonic graphs share frame; workstations define strong horizontal and vertical lines."
  },
  {
    "settingId": "S_ResLab",
    "medium": "Intimate science and character-focused workroom.",
    "lens": "Normal and short telephoto for close character beats.",
    "movement": "Gentle arcs around Liora and her boards, lingering on equations and anomalies.",
    "lighting": "Warm desk lamps mixed with cool monitor glow, no harsh shadows.",
    "composition": "Liora framed between instruments and handwritten notes, emphasizing personal responsibility for vast systems."
  },
  {
    "settingId": "S_RecordsVault",
    "medium": "Reflective archive setting with quiet tension.",
    "lens": "Short telephoto down rows of shelves, normal for two-person exchanges.",
    "movement": "Slow, straight glides along stacks and across tables.",
    "lighting": "Soft, neutral, unchanging; documents and faces easily legible.",
    "composition": "Historians dwarfed by the volume of records, suggesting how much is at stake when memory fractures."
  },
  {
    "settingId": "S_AstrinHall",
    "medium": "Public cultural gathering, festival and speech-focused.",
    "lens": "Wide lens for crowd and stage, normal for performer reactions.",
    "movement": "Sweeping passes over the audience, then steady framing on speakers.",
    "lighting": "Diffuse golden skylight with modest accent spots on stage areas.",
    "composition": "Performers foregrounded with multiworld audience visible as a soft, hopeful backdrop."
  },
  {
    "settingId": "S_OrbanPort",
    "medium": "Transit drama around departure boards and gates.",
    "lens": "Wide for concourse and gates, normal for queue-level human beats.",
    "movement": "Tracking through lines, occasional rises to show overall flow.",
    "lighting": "Soft gradient lane signage plus neutral ambient, easy to read displays and faces.",
    "composition": "Travelers framed against schedule walls and docking arms, emphasizing dependence on invisible infrastructure."
  },
  {
    "settingId": "S_OuterRing",
    "medium": "Industrial operations with a sense of exposure.",
    "lens": "Wide lens inside open framework, normal lens for worker interactions.",
    "movement": "Low tracks along beams and conduits, with exterior glimpses of the planet below.",
    "lighting": "Bright, focused worklights against darker structural recesses, all details visible.",
    "composition": "Workers small against heavy infrastructure, underlining how remote they are from central decisions."
  },
  {
    "settingId": "S_Waystation12",
    "medium": "Community and trade hub, warm and grounded.",
    "lens": "Wide for stalls and seating, normal for conversations at tables.",
    "movement": "Handheld-style steady walks through stalls, occasional pauses for personal beats.",
    "lighting": "Warm, even interior light with subtle highlights on signage and goods.",
    "composition": "Conversations framed among racks of supplies and passing families, hinting at what will be lost."
  },
  {
    "settingId": "S_DampChamber",
    "medium": "Tense technical ritual in an old facility.",
    "lens": "Normal lens in the circular room, slight wide for full apparatus.",
    "movement": "Circular tracking around the central emitter during activation.",
    "lighting": "Dim amber base light, brightening as systems energize without obscuring faces.",
    "composition": "Operators and control panels circling a central machine, underscoring the attempt to hold the network together."
  },
  {
    "settingId": "S_StressField",
    "medium": "Space anomaly sequence with clear silhouettes.",
    "lens": "Moderate telephoto to compress ships and distortions into layered depth.",
    "movement": "Calm tracking alongside affected vessels with occasional lateral shifts.",
    "lighting": "Refracted star light in clear, vivid bands; ships remain fully legible.",
    "composition": "Vessels against distorted starlines, making the invisible corridor structure visually explicit."
  },
  {
    "settingId": "S_BrokenNode",
    "medium": "Catastrophic wreck sequence.",
    "lens": "Wide lens for the fragmented node, telephoto for drifting survivors.",
    "movement": "Slow orbits around the damaged junction, cuts to closer debris action.",
    "lighting": "Unfiltered starlight and beacon flicker; all hull tears and motion readable.",
    "composition": "Node pieces arranged as a broken wheel with survivors and rescue craft navigating jagged paths."
  },
  {
    "settingId": "S_SurvivorPlaza",
    "medium": "Grounded human aftermath.",
    "lens": "Normal lens at eye level, occasional slow pull-backs.",
    "movement": "Measured dolly moves between small groups and aid stations.",
    "lighting": "Lantern and heater glow supplement weak civic lighting, keeping faces clear and comforting.",
    "composition": "Clusters of people around shared resources, with empty civic architecture beyond."
  },
  {
    "settingId": "S_RefugeSector",
    "medium": "Enclosed refugee and negotiation zone.",
    "lens": "Wide inside corridors, normal in cramped rooms.",
    "movement": "Close-quarters tracking between partitions, emphasizing density without confusion.",
    "lighting": "Patchy but intentionally kept bright where people gather or argue.",
    "composition": "Arguments and compromises framed against improvised walls and repurposed signage."
  },
  {
    "settingId": "S_PreBHA_Ruins",
    "medium": "Institutional ruin with symbolic reclamation.",
    "lens": "Normal to short telephoto inside the former operations floor.",
    "movement": "Slow pans across dark consoles and lit sigils.",
    "lighting": "Low ambient with crisp lines of emergency strips highlighting symbols and faces.",
    "composition": "Leaders framed beneath repurposed sigils, beginning the transformation into crowns."
  },
  {
    "settingId": "S_HideoutLab",
    "medium": "Quiet, late-stage problem-solving space.",
    "lens": "Normal lens for working shots, short telephoto for introspection.",
    "movement": "Gentle moves around Liora and her notes, focusing on hands and expressions.",
    "lighting": "Portable lamps and screen glow, no heavy shadows, a sense of contained focus.",
    "composition": "Liora surrounded by stacks of notes and small devices, emphasizing personal scale against vast consequences."
  },
  {
    "settingId": "S_CourierRelay",
    "medium": "Sparse station with high narrative weight.",
    "lens": "Wide lens for lonely structure scale, normal for handoff moments.",
    "movement": "Calm sets of moves between docking points and handoff locations.",
    "lighting": "Sharp cones of beacon and platform light, dark space beyond kept non-threatening but empty.",
    "composition": "Couriers exchanging packages at the edge of lit areas, representing fragile connections."
  },
  {
    "settingId": "S_ResolveCircle",
    "medium": "Early doctrinal working session.",
    "lens": "Normal lens across the table, occasional close-ups on annotated pages.",
    "movement": "Short tracks circling the group as arguments build and cool.",
    "lighting": "Practical, even work lighting; documents and faces easy to read.",
    "composition": "Faces, notes, and diagrams in the same frame, showing doctrine emerging from lived problem-solving."
  },
  {
    "settingId": "S_PreArchiveVault",
    "medium": "Quiet archival scene with long-term implications.",
    "lens": "Short telephoto down aisles, normal near the catalog station.",
    "movement": "Slow moves along shelves, punctuated by pauses on container labels and hands.",
    "lighting": "Soft, steady vault lighting that never flickers; labels and faces clearly visible.",
    "composition": "Curators small compared to shelves, placing tiny artifacts that will later define history."
  }
]
