{
  "S_CoopHall": {
    "name": "Cooperative Hall",
    "environment": "Grand interior space used for ceremonies and council sessions; stable corridor displays and formal seating tiers.",
    "lighting": "Even civic lighting with soft warm fill across banners and delegates.",
    "mood": "Institutional calm with underlying tension.",
    "camera": "Stable wide-to-medium coverage for political exchanges and formal declarations."
  },
  "S_BHANexus": {
    "name": "Beacon Harmonization Authority Nexus",
    "environment": "Precision-engineered command center for corridor harmonics monitoring; layered consoles and status bands.",
    "lighting": "Cool and even workstation light that emphasizes technical surfaces.",
    "mood": "Controlled, data-driven focus.",
    "camera": "Medium technical shots with occasional push-ins on critical displays."
  },
  "S_AstrinHall": {
    "name": "Astrin Hall",
    "environment": "Cultural venue with polished stone, festival banners, and precise acoustic panels.",
    "lighting": "Warm event lighting with pronounced overhead color accents.",
    "mood": "Celebratory, slightly ceremonial.",
    "camera": "Wide lens for crowd reveals, medium shots for interpersonal reactions."
  },
  "S_RecordsVault": {
    "name": "Records Vault",
    "environment": "Dense archive stacks, metadata scanners, and layered chronicle displays.",
    "lighting": "Soft, consistent archive illumination with minimal shadow.",
    "mood": "Scholarly focus mixed with quiet dread.",
    "camera": "Medium shots through shelving; slow pans across data surfaces."
  },
  "S_OrbanPort": {
    "name": "Orban-Tier Transit Port",
    "environment": "High-traffic terminal with shifting departure boards, crowd flow lanes, and loading gates.",
    "lighting": "Bright transit-grade light with strong signage visibility.",
    "mood": "Civic transit urgency, rising unease.",
    "camera": "Moving shots tracking civilian flow, cut-ins to unstable boards."
  },
  "S_ResLab": {
    "name": "Research Lab",
    "environment": "Compact analytical workspace with harmonic models and sensor arrays.",
    "lighting": "Neutral-white task lighting with emphasis on active displays.",
    "mood": "Technical concentration with forming alarm.",
    "camera": "Close technical inserts intercut with mid-shot collaboration."
  },
  "S_Waystation12": {
    "name": "Waystation Twelve",
    "environment": "Peripheral transfer post with narrow platforms and exposed conduit runs.",
    "lighting": "Functional corridor light with flicker in stressed zones.",
    "mood": "Transit confusion and early structural instability.",
    "camera": "Handheld tracking near queues; quick reframes on shifting windows."
  },
  "S_DampChamber": {
    "name": "Damping Chamber",
    "environment": "Ancient harmonic absorption room with dormant emitters and archaic latticework.",
    "lighting": "Low baseline light boosted by emitter activation pulses.",
    "mood": "Technical awe blended with operational risk.",
    "camera": "Slow tracking over emitters; targeted close-ups during calibration."
  },
  "S_OuterRing": {
    "name": "Outer Ring Habitat",
    "environment": "Perimeter engineering decks, exposed girders, and fluctuating life-support corridors.",
    "lighting": "Harsh utilitarian light with periodic power dips.",
    "mood": "Survival focus under resource strain.",
    "camera": "Functional mid-shots; emergency handheld during instability."
  },
  "S_StressField": {
    "name": "Stress Field Corridor Zone",
    "environment": "Space surrounding unstable corridor geometry, shimmering distortions, and ship silhouettes.",
    "lighting": "Harsh beacon scatter with inconsistent reflections across hulls.",
    "mood": "Imminent danger and unpredictable physics.",
    "camera": "Telephoto compression of ships; reactive cuts to distortion events."
  },
  "S_BrokenNode": {
    "name": "Broken Node",
    "environment": "Collapsed corridor junction with sheared structural arms drifting in vacuum.",
    "lighting": "Emergency beacon flashes and dim residual corridor glow.",
    "mood": "Catastrophic failure in progress.",
    "camera": "Wide external shots paired with close rescue coordination views."
  },
  "S_CoopHall_Alt": {
    "name": "Cooperative Council Chambers",
    "environment": "Circular debate floor with elevated viewing tiers and integrated holo displays.",
    "lighting": "Consistent top-light optimized for face clarity.",
    "mood": "Political rigidity and rising fracture.",
    "camera": "Measured circular movements framing competing voices."
  },
  "S_SurvivorPlaza": {
    "name": "Survivor Plaza",
    "environment": "Ad-hoc gathering zone built around remaining infrastructure fragments.",
    "lighting": "Patchwork ambient light from jury-rigged fixtures.",
    "mood": "Resource scarcity and communal negotiation.",
    "camera": "Ground-level medium shots capturing group exchanges."
  },
  "S_RefugeSector": {
    "name": "Refuge Sector",
    "environment": "Makeshift habitation rows with improvised barriers and contested shared space.",
    "lighting": "Mixed-quality light: emergency strips and portable lamps.",
    "mood": "Political tension under physical constraint.",
    "camera": "Tight shots emphasizing limited space and overlapping debates."
  },
  "S_PreBHA_Ruins": {
    "name": "Pre-Break BHA Ruins",
    "environment": "Cracked command floors, partial signage, exposed structural elements.",
    "lighting": "Variable remnants of power; uneven corridor spill.",
    "mood": "Authority’s collapse made physical.",
    "camera": "Oblique angles tracking characters through debris."
  },
  "S_ResolveCircle": {
    "name": "Resolve Circle",
    "environment": "Neutral-floor gathering chamber repurposed for post-Break negotiation.",
    "lighting": "Soft group lighting, intentionally even to reduce hierarchy.",
    "mood": "High-stakes debate balanced by attempts at unity.",
    "camera": "Alternating group frames and individual reaction shots."
  },
  "S_PreArchiveVault": {
    "name": "Pre-Break Archive Vault",
    "environment": "Cold storage for contested texts, sealed cases, and early codex fragments.",
    "lighting": "Controlled archive-grade illumination.",
    "mood": "Historical gravity with friction over interpretation.",
    "camera": "Slow pans across sealed cases and annotated copies."
  },
  "S_CourierRelay": {
    "name": "Courier Relay Post",
    "environment": "Transit junction with manual message racks and unreliable corridor nodes.",
    "lighting": "Dim, uneven light reflecting the relay’s instability.",
    "mood": "Urgent communication under failing systems.",
    "camera": "Moving handheld coverage tracking disputes and handoffs."
  },
  "S_HideoutLab": {
    "name": "Hideout Lab",
    "environment": "Concealed workspace with scattered drafts, mapped failures, and improvised equipment.",
    "lighting": "Low-intensity work lamps with warm tonal isolation.",
    "mood": "Quiet resolve and solitary analysis.",
    "camera": "Intimate mid-shots with slow moves across notes and diagrams."
  }
}
